# GetAllLoadedServices Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetAllLoadedServices Method
FabricationConfiguration Class See Also
---
Returns all the loaded fabrication services.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<FabricationService> GetAllLoadedServices()
```

Visual Basic
---
```text
Public Function GetAllLoadedServices As IList(Of FabricationService)
```

Visual C++
---
```text
public:
IList<FabricationService^>^ GetAllLoadedServices()
```

# ### Return Value
All the loaded fabrication services.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace